SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 2254a-16BonnG
	Comment (
		Created with EngMexx V1.0.2

	)
	Type ( Engine )
	WagonShape ( "2254a1-16BonnG.s" )
	Size ( 2.65m 3.5m 12.86m )
	CentreOfGravity ( 0m 1.7m 0m )
	Mass ( 30t )
	WheelRadius ( 0.4m )
	InertiaTensor ( Box ( 2.65m 3.5m 12.86m ) )
	Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1E6N/m 0N/m )
			Damping ( 1E6N/m/s 0N/m/s )
			Break ( 2E7N 0N )
			r0 ( 15cm 1E9m )
		)
		CouplingUniqueType ( "Scharfenberg" )
		CouplingHasRigidConnection (  )
		Velocity ( 1m/s )
	)
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 3cm )
	DerailRailForce ( 70kN )
	DerailBufferForce ( 40kN )
	NumWheels ( 4 )
	Friction (
		150N/m/s	1	52mph	80000N/m/s	1.2
		0N/rad/s	1	-1rad/s	0N/rad/s	1
	)
	AntiSlip (  )
	BrakeEquipmentType ( "ep_brake" )
	BrakeSystemType ( EP )
	MaxBrakeForce ( 0kN )
	EmergencyBrakeResMaxPressure ( 90 )
	TripleValveRatio ( 1 )
	MaxReleaseRate ( 20 )
	MaxApplicationRate ( 20 )
	MaxAuxilaryChargingRate ( 1 )
	EmergencyResCapacity ( 1 )
	EmergencyResChargingRate ( 1 )
	BrakeCylinderPressureForMaxBrakeBrakeForce ( 50 )
	Inside (
		PassengerCabinFile ( "Inside-16BonnG.s" )
		PassengerCabinHeadPos ( -0.67m 2.1m 1.75m )
		RotationLimit ( 25 25 25 )
		StartDirection ( 0 0 0 )
		Sound ( "..\\..\\KVB B80D\\Sound_B80D\\KVB_B80D_Pas.sms" )
	)
	PassengerCapacity ( 280 )
	Lights ( 11
		Light (
			comment ( Lichtkegel #1 )
			Type ( 1 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFEBA4 )
					Position ( 0 3 10 )
					Azimuth ( 0 0 0 )
					Angle ( 20 )
					Transition ( 0 )
					Radius ( 100 )
				)
			)
		)
		Light (
			comment ( Lichtkegel #2 )
			Type ( 1 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFF9E1 )
					Position ( 0 3.5 -1 )
					Angle ( 15 )
					Transition ( 0 )
					Radius ( 190 )
				)
			)
		)
		Light (
			comment ( vorn rechts abgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFEBA4 )
					Position ( -0.65 1.12 6.4 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.22 )
				)
			)
		)
		Light (
			comment ( vorn links abgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFEBA4 )
					Position ( 0.65 1.12 6.4 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.22 )
				)
			)
		)
		Light (
			comment ( vorn mitte abgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFEBA4 )
					Position ( 0 3.42 6.07 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.19 )
				)
			)
		)
		Light (
			comment ( vorn rechts aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFF9E1 )
					Position ( -0.65 1.12 6.4 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.45 )
				)
			)
		)
		Light (
			comment ( vorn links aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFF9E1 )
					Position ( 0.65 1.12 6.4 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.45 )
				)
			)
		)
		Light (
			comment ( vorn mitte aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFF9E1 )
					Position ( 0 3.42 6.07 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.45 )
				)
			)
		)
		Light (
			comment ( AI vorn rechts  )
			Type ( 0 )
			Conditions (
				Unit ( 2 )
				Control ( 1 )
				Service ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFF9E1 )
					Position ( -0.65 1.12 6.4 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.45 )
				)
			)
		)
		Light (
			comment ( AI vorn links  )
			Type ( 0 )
			Conditions (
				Unit ( 2 )
				Control ( 1 )
				Service ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFF9E1 )
					Position ( 0.65 1.12 6.4 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.45 )
				)
			)
		)
		Light (
			comment ( AI vorn mitte  )
			Type ( 0 )
			Conditions (
				Unit ( 2 )
				Control ( 1 )
				Service ( 2 )
			)
			FadeIn ( 0.2 )
			FadeOut ( 0.2 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFF9E1 )
					Position ( 0 3.42 6.07 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.45 )
				)
			)
		)
	)
	Sound ( "..\\..\\KVB B80D\\Sound_B80D\\KVB_B80D_Eng.sms" )
)

Engine ( 2254a-16BonnG
	Wagon ( "2254a-16BonnG" )
	Type ( Electric )
	MaxPower ( 600kW )
	MaxForce ( 45kN )
	MaxContinuousForce ( 35kN )
	MaxVelocity ( 80km/h )
	MaxCurrent ( 470A )
	WheelRadius ( 0.5m )
	Vigilance ( 0 0 )
	Sanding ( 1mph )
	MaxSandingTime ( -1 )
	NumWheels ( 4 )

	HeadOut ( 1.7m 2.4m 5.8m )

	AirBrakesAirCompressorPowerRating ( 4 )
	AirBrakesAirCompressorWattage ( 19000 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure ( 0.5 )
	AirBrakesCompressorRestartPressure ( 95 )
	AirBrakesHasLowPressureTest ( 1 )
	AirBrakesIsCompressorElectricOrMechanical ( 1 )
	AirBrakesMainMaxAirPressure ( 100 )
	AirBrakesMainMinResAirPressure ( 30 )
	AirBrakesMainResVolume ( 1 )
	EngineBrakesControllerMaxApplicationRate ( 10 )
	EngineBrakesControllerMaxReleaseRate ( 20 )
	EngineBrakesControllerEmergencyApplicationRate ( 10 )
	EngineBrakesControllerMinSystemPressure ( 0 )
	EngineBrakesControllerMaxSystemPressure ( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	EngineBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesControllerHasProportionalBrake ( 1 )
	TrainBrakesControllerMinPressureReduction ( 6 )
	TrainBrakesControllerMaxApplicationRate ( 10 )
	TrainBrakesControllerMaxReleaseRate ( 20 )
	TrainBrakesControllerEmergencyApplicationRate ( 10 )
	TrainBrakesControllerMinSystemPressure ( 0 )
	TrainBrakesControllerMaxSystemPressure ( 90 )
	TrainBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	TrainBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesProportionalBrakeLag ( 0.9 )

	DynamicBrakesMinUsableSpeed ( -87 )
	DynamicBrakesMaximumEffectiveSpeed ( -37 )
	DynamicBrakesMaximumForce ( 40kN )
	DynamicBrakesResistorCurrentLimit ( 500 )
	DynamicBrakesCutInSpeed ( -86 )
	DynamicBrakesFadingSpeed ( 37 )
	DynamicBrakesDelayTimeBeforeEngaging ( 0 )
	DynamicBrakesMaximumSpeedForFadeOut ( 87 )
	DynamicBrakesEffectAtMaximumFadeOut ( 0 )
	DynamicBrakesHigherSpeedCurveExponent ( 1 )
	DynamicBrakesLowerSpeedCurveExponent ( 1 )
	DynamicBrakesNumberOfControllerNotches ( 2 )
	DynamicBrakeHasAutoBailOff ( 1 )
	BrakesTrainBrakeType ( EP )
	BrakesEngineControllers ( "Train,Dynamic" )
	CabView ( "B80DCab.cvf" )

	DoesHornTriggerBell ( 0 )

	EmergencyStopMonitor (
		MonitoringDeviceMonitorTimeLimit ( 0 )
		MonitoringDeviceAlarmTimeLimit ( 0 )
		MonitoringDevicePenaltyTimeLimit ( 0 )
		MonitoringDeviceCriticalLevel ( 0 )
		MonitoringDeviceResetLevel ( 0 )
		MonitoringDeviceAppliesFullBrake ( 1 )
		MonitoringDeviceAppliesEmergencyBrake ( 1 )
		MonitoringDeviceAppliesCutsPower ( 1 )
		MonitoringDeviceAppliesShutsDownEngine ( 1 )
		MonitoringDeviceResetOnResetButton ( 1 )
		MonitoringDeviceResetOnZeroSpeed ( 1 )
	)

	EngineControllers (
		AWS ( 0 1 0 )
		BailOffButton ( 0 1 0 )
		BellToggle ( 0 1 0 )
		Brake_Dynamic ( 0 1 0.142857142857143 0
			NumNotches ( 8
				Notch ( 0 0 Dummy )
				Notch ( 0.142857 0 Dummy )
				Notch ( 0.285714 0 Dummy )
				Notch ( 0.428571 0 Dummy )
				Notch ( 0.571428 0 Dummy )
				Notch ( 0.714285 0 Dummy )
				Notch ( 0.857142 0 Dummy )
				Notch ( 0.999999 0 Dummy )
			)
		)
		Brake_Train ( 0 1 1 0
			NumNotches ( 3
				Notch ( 0 0 TrainBrakesControllerReleaseStart )
				Notch ( 1 0 TrainBrakesControllerFullServiceStart )
				Notch ( 0 0 TrainBrakesControllerEmergencyStart )
			)
		)
		Throttle ( 0 1 0.142857142857143 0
			NumNotches ( 8
				Notch ( 0 0 Dummy )
				Notch ( 0.142857 0 Dummy )
				Notch ( 0.285714 0 Dummy )
				Notch ( 0.428571 0 Dummy )
				Notch ( 0.571428 0 Dummy )
				Notch ( 0.714285 0 Dummy )
				Notch ( 0.857142 0 Dummy )
				Notch ( 0.999999 0 Dummy )
			)
		)
		Combined_Control ( 0 1 0.5 0.5 throttle dynamic )
		DirControl ( -1 0 1 1 )
		EmergencyStopToggle ( 0 1 0 )
		Headlights ( 0 0.25 1 0 )
		Horn ( 0 1 0 )
		PantographToggle1 ( 0 1 1 )
		Sanding ( 0 1 0 )
		Vigilance ( 0 1 0 )
		Wipers ( 0 1 0 )
	)

	Name ( "KVB 2254 16 Bonn Godes" )
	Sound ( "..\\..\\KVB B80D\\Sound_B80D\\KVB_B80D_Cab.sms" )

	Description (
		"Stadtbahnwagen B100S der Kölner Verkehrs-Betriebe AG\n\nDer Stadtbahnwagen B (kurz: B-Wagen) ist ein regelspuriges Hochflur-Stadtbahn-Fahrzeug, von dem zwischen 1973 und 1996 insgesamt knapp 470 Exemplare gebaut wurden, die auf verschiedenen Stadtbahn-Netzen in Nordrhein-Westfalen zum Einsatz kommen. Entwickelt wurde das Fahrzeug von der Düsseldorfer Waggonfabrik DUEWAG, die auch den größten Teil baute. Im Allgemeinen handelt es sich dabei um 2,65 m breite und 28 m lange zweiteilige Fahrzeuge auf drei Drehgestellen mit insgesamt sechs Achsen.\n\n" +
		"Ab 1984 beschafften Bonn und Köln weitere B-Serien. Diese in Köln eingesetzte Serie, die Ende der 1980er Jahre entstand, hat nur einen Führerstand an einem Wagenende (Serie 2200) und verkehrt nur in Doppeltraktion. Von diesem Typ lieferte die Berliner „Waggon-Union“ zehn Fahrzeuge nach Köln."
	)
)
